Revit 2026 API

# RoomUpperLimit Property

---

Get or Set the Upper Limit of the Room.

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Level UpperLimit { get; set; }
```
```vb
Public Property UpperLimit As Level
	Get
	Set
```
```cpp
public:
property Level^ UpperLimit {
	Level^ get ();
	void set (Level^ value);
}
```
```fsharp
member UpperLimit : Level with get, set
```

#### Property Value

Level

This property is used to get or set the Upper Limit of the Room.

#### Reference

Room Class

Autodesk.Revit.DB.Architecture Namespace